# GUIDED PROJECT: Analuzing CIA Factbook Data Using SQL

### Introduction 
Connect Jupyter Notebook to database files.

In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

### Overview of the Data
1. Write a query to return information on the tables in the database.

2. Write and run another query that returns the first 5 rows of the facts table in the database.

In [5]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [7]:
%%sql
SELECT * FROM facts limit 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Summary Statistic 
Write a single query that returns the:

Minimum population
Maximum population
Minimum population growth
Maximum population growth

In [11]:
%%sql
SELECT MIN(population) as min_pop, MAX(population) max_pop,
        MIN(population_growth) min_pop_growth, 
        Max(population_growth) max_pop_growth
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

### Exploring Outliers
1. Write a query that returns the countrie(s) with the minimum population.
2. Write a query that returns the countrie(s) with the maximum population.

In [16]:
%%sql
SELECT * FROM facts
WHERE population = (SELECT MIN(population) FROM facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [15]:
%%sql
SELECT * FROM facts
WHERE population = (SELECT MAX(population) FROM facts);

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

### Exploring Average Population and Area 
1. Calculate the average value for the following columns: population and area

In [17]:
%%sql
SELECT AVG(population) avg_pop, AVG(area) avg_area from facts;

Done.

[(62094928.32231405, 555093.546184739)]

### Finding Densely Populated Countries
Write a query that finds all countries meeting both of the following conditions:
1. The population is above average.
2. The area is below average.

In [ ]:
SELECT * FROM facts
WHERE population > 
        (SELECT AVG(population)from facts;)
    AND
        area <
            (SELECT AVG(ar)from facts;)